package linear_programs;

public class Ex1 {

	public static void main(String[] args) {
		// Даны два действительных числа х и у. Вычислить их сумму, разность,
		// произведение и частное.
		double x = 10;
		double y = 5;
		double sum = x + y;
		double dif = x - y;
		double proiz = x * y;
		double chast = x / y;
		System.out.println("sum =" + sum + "\ndif=" + dif + "\nproizvedenie=" + proiz + "\nchastnoe=" + chast);
	}

}
