package linear_programs;

public class Ex7 {

	public static void main(String[] args) {
		// Дан прямоугольник, ширина которого в два раза меньше длины.
		// Найти площадь прямоугольника.

		double height;
		double length;
		double area;
		height = 5;
		length = height * 2;
		area = height * length;
		System.out.println("rectangle area = " + area);

	}

}
