package vetvlenia;

public class Ex2 {

	public static void main(String[] args) {
		// 2.Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести
		// на экран слово «yes», в противном случае – слово «no»
		int a = 1;
		int b = 2;
		if (a < b) {
			System.out.println("Yes");
		} else {
			System.out.println("No");
		}

	}

}
