package vetvlenia;

public class Ex24 {

	public static void main(String[] args) {
		// 24. Составить программу, определяющую результат гадания на ромашке —
		// «любит—не любит», взяв за исходное данное количество лепестков п.
		int n = 2;
		if (n % 2 == 0) {
			System.out.println("doesn't love");
		} else {
			System.out.println("love");
		}

	}

}
